[
  {
    "name": "Anthony Montanaro",
    "title": "Chair",
    "linkedin": "https://www.linkedin.com/in/anthony-montanaro/",
    "email": "chair@iiseconcordia.com",
    "image": "team-page/team-2024-2025/Anthony.jpg",
    "bio": "Anthony is an alumnus of Concordia's undergraduate industrial engineering program, and is currently completing his Master's of Science in Industrial Engineering at Concordia. With his previous 4 years of experience as part of IISE Concordia, he provides his knowledge to the team to ensure event quality is maintained."
  },
  {
    "name": "Matthew Derocher",
    "title": "President",
    "linkedin": "www.linkedin.com/in/matthew-derocher",
    "email": "president@iiseconcordia.com",
    "image": "team-page/team-2024-2025/Matthew.jpg",
    "bio": "Matthew is a fourth-year industrial engineering student at Concordia. He entered IISE as VP social in his first year where he organized some of the association's biggest events, notably the annual wine & cheese. In the following year he transitioned to the leadership role of Senior VP which was the perfect position to get invaluable experience about the internal affairs of IISE. After being elected as President by his fellow executives, Matthew is determined to lead the team to very ambitious goals throughout the mandate. Notably, to grow the team, increase the quantity & quality of events & maintain IISE’ s reputation as the benchmark for Concordia student associations."
  },
  {
    "name": "Rebecca Nunn",
    "title": "Senior VP",
    "linkedin": "https://www.linkedin.com/in/rebecca-nunn77/",
    "email": "seniorvp@iiseconcordia.com",
    "image": "team-page/team-2024-2025/Rebecca.jpg",
    "bio": "Rebecca is a fifth-year industrial engineering student who is excited to be returning to the IISE team for her third consecutive year. After serving as VP Internal and VP Finance in previous years, she is now drawing from her experiences to lead and support the team in her current role of Senior Vice President. She is proud of the great work that IISE does, from the academic and career enriching events to the community it facilitates for the Industrial Engineering students of Concordia."
  },
  {
    "name": "Esinti Baskak",
    "title": "Sage",
    "linkedin": "https://www.linkedin.com/in/esinti-baskak/",
    "email": "sage@iiseconcordia.com",
    "image": "team-page/team-2024-2025/Esinti.jpg",
    "bio": "Esinti is a fifth-year industrial engineering student who will be taking on the role of sage for the second consecutive year! With four years of experience at IISE in various roles, including social director, general director, and sage, Esinti brings valuable expertise to the position. As sage, Esinti will collaborate with the head team and subteams to ensure the smooth execution of events while ensuring compliance with the bylaws of IISE and ECA."
  },
  {
    "name": "Karim Louka",
    "title": "General Director",
    "linkedin": "https://www.linkedin.com/in/karimlouka/",
    "email": "general.director.internal@iiseconcordia.com",
    "image": "team-page/team-2024-2025/Karim.jpg",
    "bio": "Karim is a third-year industrial engineering student who’s excited about continuing his journey with the IISE as General Director - Internal for the 2024-25 academic year. In the 2023-24 academic year , Karim was the Director of Innovations and spearheaded the creation of the YouTube channel, a project that’s successfully running in the current academic year. As General Director, Karim provides support to all sub-teams as well as supports the creation of the Book of IISE alongside the rest of the Head Team. "
  },
  {
    "name": "Yasmin Saade",
    "title": "General Director",
    "linkedin": "https://www.linkedin.com/in/yasmin-saade/",
    "email": "director@iiseconcordia.com",
    "image": "team-page/team-2024-2025/Yasmin.jpg",
    "bio": "Yasmin is a fourth-year industrial engineering student, excited to join IISE for the third consecutive year. Previously, she was part of the social team, serving as Director Social and VP Social, where she organized social and professional events for society members and students. This year, she was elected as General Director External, supporting all sub-teams and contributing to the Book of IISE. Yasmin is passionate about promoting teamwork and maintaining a high spirit within the student body. She is proud to be part of a great team and eager for the year ahead."
  },
  {
    "name": "Ana Guadron",
    "title": "First Lady",
    "linkedin": "https://www.linkedin.com/in/ana-guadron-2572351b8/",
    "email": "firstlady@iiseconcordia.com",
    "image": "team-page/team-2024-2025/Ana.png",
    "bio": "Ana Guadron is a fifth-year engineering student grateful for the opportunity to serve IISE for a fourth consecutive year. Building on her experiences as VP Webmaster (2022-2023) and VP Conference (2023-2024), she now supports the President as First Lady. In this role, Ana assists with team coordination and event planning, contributing to key events like the national conference and Industry Week. She's committed to learning from and supporting her colleagues, striving to make a positive impact within the association."
  },
  {
    "name": "Albert Francis",
    "title": "VP Competitions",
    "linkedin": "",
    "email": "competitions@iiseconcordia.com",
    "image": "team-page/team-2024-2025/Albert.jpg",
    "bio": ""
  },
  {
    "name": "Jad Chahine",
    "title": "Competitions Director",
    "linkedin": "https://linkedin.com/in/example1",
    "email": "director.competition@iiseconcordia.com",
    "image": "team-page/team-2024-2025/Jad.jpg",
    "bio": "Jad is a 3rd year Industrial Engineering CO-OP student, and is this year's Director Competitions! Apart from working in Project Engineering at Bombardier, he also has a passion in Movie Production and Music."
  },
  {
    "name": "Eric Haddad",
    "title": "VP Innovations",
    "linkedin": "www.linkedin.com/in/erichaddad",
    "email": "innovations@iiseconcordia.com",
    "image": "team-page/team-2024-2025/Eric.jpg",
    "bio": "Eric Haddad is a third-year industrial engineering student who recently joined the IISE. They are passionate about fostering community and engagement among their peers, demonstrated by their initiative in creating a dedicated Discord server for industrial engineering students. This platform helps connect students and encourages greater involvement. As this is their first year with IISE, Eric is excited to contribute to the team and support various initiatives aimed at enhancing the student experience."
  },
  {
    "name": "Liam Caissy",
    "title": "VP Conference",
    "linkedin": "https://linkedin.com/in/example1",
    "email": "conference@iiseconcordia.com",
    "image": "team-page/team-2024-2025/Liam.jpg",
    "bio": "Liam is a fourth-year industrial engineering student at Concordia. After joining IISE in 2021 as a first-year representative, as the VP Sponsorship in 2022, and as the President in 2023, he decided to pursue as the VP Conference for 2023. He is thrilled to be part of this excellent association and to help lead the team towards success."
  },
  {
    "name": "Philippe Desrochers",
    "title": "Director Conference",
    "linkedin": "",
    "email": "director.conference@iiseconcordia.com",
    "image": "team-page/team-2024-2025/Philippe.png",
    "bio": ""
  },
  {
    "name": "Prithish Manchanda",
    "title": "VP Webmaster",
    "linkedin": "https://www.linkedin.com/in/prithish-manchanda/",
    "email": "webmaster@iiseconcordia.com",
    "image": "team-page/team-2024-2025/Prithish.jpg",
    "bio": "Prithish is a fifth-year Industrial Engineering student at Concordia and is excited to embark on his first year with IISE. He is looking forward to networking with his peers and build meaningful connections. As a VP Webmaster he will play a vital role in developing and maintaining the website, promote IISE events, and create newsletters."
  },
  {
    "name": "Éléna Gagnon",
    "title": "VP Marketing",
    "linkedin": "https://www.linkedin.com/in/gagnonelena/",
    "email": "marketing@iiseconcordia.com",
    "image": "team-page/team-2024-2025/Elena.jpg",
    "bio": "As she starts her fourth year at Concordia, Éléna is currently helding a VP position for the second time in IISE. She started last year as VP Academics, and now she is the new VP of Marketing. This year’s focus is on reflecting the human side of the association. The team wants to show the students who is behind the name, and the benefits of being part of the biggest East-Canadian Chapter of IISE. "
  },
  {
    "name": "Aristi Constantopoulos",
    "title": "Director Marketing",
    "linkedin": "www.linkedin.com/in/aristi-constantopoulos ",
    "email": "marketing.director@iiseconcordia.com",
    "image": "team-page/team-2024-2025/Aristi.jpg",
    "bio": "Aristi Constantopoulos is a fourth-year Industrial Engineering student at Concordia, and is currently in her first year with the IISE. In her role as Director of Marketing, Aristi is responsible for executing the association's social media strategy to increase engagement, build community, and promote events, and initiatives."
  },
  {
    "name": "Kenza Smaki",
    "title": "Director of Photography",
    "linkedin": "www.linkedin.com/in/kenza-smaki-878857201",
    "email": "director.photography@iiseconcordia.com",
    "image": "team-page/team-2024-2025/Kenza.jpg",
    "bio": "Kenza Smaki is a first year industrial engineering student at Concordia university and it is her first year with the association. She is the first at IISE to hold the Director of Photography position. She is in charge of filming content and photographing for IISE’s social media. She works closely with the marketing team and is always ready to tackle new challenges. "
  },
  {
    "name": "Catherine Michael",
    "title": "VP Social",
    "linkedin": "www.linkedin.com/in/catherine-michael-099263294",
    "email": "social@iiseconcordia.com",
    "image": "team-page/team-2024-2025/Catherine.png",
    "bio": "Catherine Michael is a second-year industrial engineering student and the current VP of Social, following her role as the First Year Representative last year. This year, she and her colleague Ghadi are focused on increasing event attendance by launching exciting new ideas and making events more interactive and engaging for students. Their aim is to encourage participation and connection along industrial engineering students at Concordia."
  },
  {
    "name": "Ghadi Karim",
    "title": "Social Director",
    "linkedin": "www.linkedin.com/in/ghadikarim",
    "email": "director.social@iiseconcordia.com",
    "image": "team-page/team-2024-2025/Ghadi.JPG",
    "bio": "Ghadi Karim is a third-year industrial engineering student and is excited to embark on their first year with IISE. As the social director, they are bringing fresh ideas and energy to the team. Keep an eye out for upcoming events, exciting things are in the works, and you won’t want to miss what’s coming next!"
  },
  {
    "name": "Stephen Tomasin",
    "title": "VP Sponsorship",
    "linkedin": "www.linkedin.com/in/stephen-tomasin",
    "email": "sponsorship@iiseconcordia.com",
    "image": "team-page/team-2024-2025/Stephen.jpg",
    "bio": "Stephen Tomasin is a fifth-year Industrial Engineering student, advancing from his role as Social Director (2023-2024) to VP of Sponsorships. In this role, Stephen develops creative sponsorship packages and works closely with the internal team and sponsors to secure the funding that keeps the chapter running. His proactive communication, creative thinking and strong relationship-building skills are key to the success of all external events. "
  },
  {
    "name": "Jamil Salloum",
    "title": "VP External",
    "linkedin": "https://www.linkedin.com/in/jamilsalloum/",
    "email": "external@iiseconcordia.com",
    "image": "team-page/team-2024-2025/Jamil.jpg",
    "bio": "Jamil is a 3rd year Industrial Engineering student and has been in IISE as VP External as well as First Year Rep. He got to network with a lot of company representatives and Industrial Engineering students last year so he decided to take on VP External again this year to organize and oversee workshops and Lunch & Learns while using the insight he gained last year in the position to enhance the experience of students and company representatives. He looks forward to being part of the team for another year and achieving amazing events together."
  },
  {
    "name": "Macarena Luna",
    "title": "Director External",
    "linkedin": "https://www.linkedin.com/in/macarena-luna-victoria",
    "email": "director.external@iiseconcordia.com",
    "image": "team-page/team-2024-2025/Macarena.jpg",
    "bio": "Macarena is a third-year industrial engineering student and the current External Director at IISE. In her first year with the organization, she’s eager to take on responsibilities alongside the VP External, overseeing event planning and outreach programs while coordinating with sponsors and Concordia charities. Her strong organizational and event-planning skills will ensure successful and impactful events."
  },
  {
    "name": "Greg Nached",
    "title": "VP Academics",
    "linkedin": "https://ca.linkedin.com/in/greg-marwan-nached",
    "email": "academics@iiseconcordia.com",
    "image": "team-page/team-2024-2025/Greg.jpeg",
    "bio": "Greg is a 4th Year Industrial Engineering CO-OP Student. He is returning to our Academics Team, transition from his former position as Director of Academics. He, along with the Academics Directors, look forward to helping students through their academic journeys."
  },
  {
    "name": "Maria Paula",
    "title": "Director Academics",
    "linkedin": "www.linkedin.com/in/maria-paula-almendarez",
    "email": "director.academics@iiseconcordia.com",
    "image": "team-page/team-2024-2025/Maria.jpg",
    "bio": "Maria Paula is a third year industrial engineering student from Honduras.She join IISE last year as external director and she is now the Director of Academics bringing new ideas to the Academics team.She organize events such as plant tours,crash courses,linkedin photoshoots,etc.She wants to help other engineer students succeed academically and learn more about industrial engineering."
  },
  {
    "name": "Gerardo Mendoza",
    "title": "Director Academics",
    "linkedin": "www.linkedin.com/in/gerardomendozae",
    "email": "director.academics@iiseconcordia.com",
    "image": "team-page/team-2024-2025/Gerardo.png",
    "bio": "Gerardo is a third-year industrial engineering student from El Salvador. He started his journey with IISE a year ago serving as First Year Representative during the 2023-24 academic year, he is now the Director of Academics, bringing innovative ideas to the Academics team and looking to help anyone that needs it so the team can achieve their goals for this year. His main responsibilities are to organize events such as crash courses, interviews, photoshoots, etc. His goal for the Academics team this year is to be able to improve industrial engineering students’ skills to be more attractive in the current job market."
  },
  {
    "name": "Ruben Yamin",
    "title": "VP Finance",
    "linkedin": "https://www.linkedin.com/in/ruben-yamin-lssgb-329663270/",
    "email": "finance@iiseconcordia.com",
    "image": "team-page/team-2024-2025/Ruben.jpg",
    "bio": "Ruben is in his last year of Industrial Engineering, having previously held the role of VP Internal, he is thrilled to take on a new position as VP Finance. Ruben ensures IISE is able to realize its great events and activities by managing the association’s budget and taking care of all finance related matters. "
  },
  {
    "name": "Nishanth Shetty",
    "title": "Graduate Student Rep",
    "linkedin": "https://www.linkedin.com/in/nishanth-n-shetty/",
    "email": "grad.student.rep@iiseconcordia.com",
    "image": "team-page/team-2024-2025/Nishanth.jpg",
    "bio": "Nishanth, a second-year Industrial Engineering master’s student at Concordia University, is a graduate student representative for IISE. With 3 years of experience at Volvo and Robert Bosch, he brings industry expertise to the role. He promotes IISE events to graduate students, organizes graduate panels, and provides input to align events with master’s students' needs. Nishanth also offers guidance to undergraduates and welcomes suggestions to enhance the IISE experience."
  },
  {
    "name": "Komal Patel",
    "title": "VP Internal",
    "linkedin": "",
    "email": "director.media@iiseconcordia.com",
    "image": "team-page/team-2024-2025/Komal.jpg",
    "bio": "Komal is a third-year industrial engineering student who began her journey with IISE as a First-Year Representative. Last year, she took on the role of VP Webmaster, and this year, she’s excited to serve as VP Internal. In this position, she is responsible for managing team communications and overseeing event planning logistics, allowing her to support the team in a meaningful way. "
  },
  {
    "name": "Ognyan Zlatev",
    "title": "VP Media",
    "linkedin": "",
    "email": "media@iiseconcordia.com",
    "image": "team-page/team-2024-2025/Ognyan.png",
    "bio": ""
  },
  {
    "name": "Sirene Saber",
    "title": "Director Media",
    "linkedin": "www.linkedin.com/in/Sirenesaber",
    "email": "director.media@iiseconcordia.com",
    "image": "team-page/team-2024-2025/Sirene.jpeg",
    "bio": "Sirene Saber is a 4th-Year Industrial Engineering student who recently joined IISE. After taking the Arena Simulation course, she discovered a newfound interest in the subject and wished to explore this passion further. By joining the Media Team, she can excitedly announce that she’s working on a video series to help other students study and excel in this subject."
  },
  {
    "name": "Monem Alsemien",
    "title": "Director Media",
    "linkedin": "https://www.linkedin.com/in/monemalsemien",
    "email": "director.media@iiseconcordia.com",
    "image": "team-page/team-2024-2025/Monem.jpg",
    "bio": "Monem Alsemien is a 4th-Year Industrial Engineering students who has just recently joined the IISE. A little late to the party, he is excited to learn from his colleagues while also exploring his passion for teaching through being a member of the Media Team. With a knack for anything OR, he’s excited to be working on a video series for INDU 324"
  },
  {
    "name": "Helia Borran",
    "title": "First-Year Rep",
    "linkedin": "www.linkedin.com/in/heliaborran",
    "email": "fyr@iiseconcordia.com",
    "image": "team-page/team-2024-2025/Helia.png",
    "bio": "Helia is a first-year Industrial Engineering student at Concordia University, originally from Iran. As the First-Year Representative for the IISE Concordia chapter, she draws on her diverse background to emphasize the importance of inclusivity and teamwork in addressing complex challenges. She is dedicated to being a voice for those who need it, advocating for her peers and ensuring their ideas are heard. She is eager to create opportunities for first-year students to get involved, fostering a sense of belonging and encouraging active participation within IISE."
  },
  {
    "name": "Camila Vasquez",
    "title": "First-Year Rep",
    "linkedin": "www.linkedin.com/in/camila-vasquez-25a6292a8 ",
    "email": "fyr2@iiseconcordia.com",
    "image": "team-page/team-2024-2025/Camila.png",
    "bio": "Camila Vasquez is a first year Industrial Engineering student. She recently joined the IISE as a First Year Representative for the 2024-2025 academic year. In essence, Camila serves as the link between the first year students and the IISE. She joined the IISE because it was a great opportunity to make connections, to participate in the Concordia Student life and to work closely alongside other Industrial Engineering students. Camila hopes to promote the IISE among her peers at Concordia and participate in various IISE events."
  }
]